<?php
/*冒泡排序
 *临近的数字两两比较，按照从小到大或者从大到小的顺序进行交换
 *这样一趟过去后,最大或最小的数字被交换到了最后一位,然后
 *再从头开始进行两两比较交换,直到倒数第二位时结束
 *例如:
 * $i=0  8,11,6,22,3,5,9
 * $i=1  8,6,11,22,3,5,9
 * $i=2  8,6,11,22,3,5,9
 * $i=3  8,6,11,3,22,5,9
 * $i=4  8,6,11,3,5,22,9
 * $i=5  8,6,11,3,5,9,22
 */

$arr = [11,8,6,22,3,5,9];

/*
for($k=0;$k<$len;$k++){
    for($i=$k+1;$i<$len;$i++){
        if($arr[$i]>$arr[$k]){
            $tmp = $arr[$i];
            $arr[$i] = $arr[$k];
            $arr[$k] = $tmp;
        }
    }
}
var_dump($arr);
*/
function bubble($arr){
    $len = count($arr);
    //该层循环控制 需要冒泡的轮数
    for($i=1;$i<$len;$i++){
        //该层循环用来控制每轮 冒出一个数 需要比较的次数
        for($k=0;$k<$len-$i;$k++){
            if($arr[$k]>$arr[$k+1]){
                $tmp = $arr[$k+1];
                $arr[$k+1] = $arr[$k];
                $arr[$k] = $tmp;
            }
        }
    }
    return $arr;
}

print_r(bubble($arr));