<?php
/*冒泡排序
 *临近的数字两两比较，按照从小到大或者从大到小的顺序进行交换
 *这样一趟过去后,最大或最小的数字被交换到了最后一位,然后
 *再从头开始进行两两比较交换,直到倒数第二位时结束
 *例如:
 * $i=0  8,11,6,22,3,5,9
 * $i=1  8,6,11,22,3,5,9
 * $i=2  8,6,11,22,3,5,9
 * $i=3  8,6,11,3,22,5,9
 * $i=4  8,6,11,3,5,22,9
 * $i=5  8,6,11,3,5,9,22
 */

$arr = [11,8,6,22,3,5,9];

$num = count($arr);

/*
for($k=0;$k<$num;$k++){
    for($i=0;$i<$num-$k-1;$i++){
        if($arr[$i]>$arr[$i+1]){
            $tmp = $arr[$i];
            $arr[$i] = $arr[$i+1];
            $arr[$i+1] = $tmp;
        }
    }
}
var_dump($arr);
*/

for($k=0;$k<$num;$k++){
    for($i=$k+1;$i<$num;$i++){
        if($arr[$i]>$arr[$k]){
            $tmp = $arr[$i];
            $arr[$i] = $arr[$k];
            $arr[$k] = $tmp;
        }
    }
}
var_dump($arr);